;;===================================================================================================
;;	File created by -bg- before	25/01/22	19:00	
;;	LAST UPDATED by RustyDios	26/01/22	01:30
;;
;;	CUSTOM SPARK CLASS SUPPORT WITH SUPPORT FOR MW AND MOF TO BUILD HIGHER RANK
;;
;;===================================================================================================

[SparkChooseClass X2SoldierClassTemplate]
DisplayName="选择SPARK"
ClassSummary="正在使用的是默认的SPARK职业。\n请返回军械库，晋升并选择这个SPARK单元的职业。"

;OLD VERTICLE PROMOTION TREE
LeftAbilityTreeTitle="选择"
RightAbilityTreeTitle="职业"

;NEW HORIZONTAL PROMOTION TREE
+AbilityTreeTitles = "请"
+AbilityTreeTitles = "选择"
+AbilityTreeTitles = "SPARK"
+AbilityTreeTitles = "职业"

RankNames[0]="选择职业"
RankNames[1]="选择职业"
RankNames[2]="选择职业"
RankNames[3]="选择职业"
RankNames[4]="选择职业"
RankNames[5]="选择职业"
RankNames[6]="选择职业"
RankNames[7]="选择职业"

;RankNames[0]="Please"
;RankNames[1]="Choose"
;RankNames[2]="This"
;RankNames[3]="Units"
;RankNames[4]="Custom"
;RankNames[5]="Spark"
;RankNames[6]="Class"
;RankNames[7]="Thankyou"

;RankNames[0]="Please"
;RankNames[1]="Make"
;RankNames[2]="Your"
;RankNames[3]="Selection"
;RankNames[4]="Followed"
;RankNames[5]="By The"
;RankNames[6]="# Sign"
;RankNames[7]="Nowwww"

ShortNames[0]="Spk."
ShortNames[1]="Spk."
ShortNames[2]="Spk."
ShortNames[3]="Spk."
ShortNames[4]="Spk."
ShortNames[5]="Spk."
ShortNames[6]="Spk."
ShortNames[7]="Spk."

RankIcons[0]="UILibrary_DLC3Images.rank_squire"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"

;;===================================================================================================

;NORMAL DEFAULT SPARK LOCALISATION 
;IF YOU WANT CHOOSE SPARK TO MATCH
;COMMENT THE ABOVE AND UNCOMMENT THE BELOW

;RankNames[0]="新兵"
;RankNames[1]="侍从"
;RankNames[2]="志士"
;RankNames[3]="骑士"
;RankNames[4]="武士"
;RankNames[5]="先锋"
;RankNames[6]="圣骑士"
;RankNames[7]="冠军"

;ShortNames[0]="Rk."
;ShortNames[1]="Sqr."
;ShortNames[2]="Asp."
;ShortNames[3]="Knt."
;ShortNames[4]="Cav."
;ShortNames[5]="Vng."
;ShortNames[6]="Pal."
;ShortNames[7]="Chp."

;RankIcons[0]="UILibrary_Common.rank_rookie"
;RankIcons[1]="UILibrary_DLC3Images.rank_squire"
;RankIcons[2]="UILibrary_DLC3Images.rank_cavalier"
;RankIcons[3]="UILibrary_DLC3Images.rank_knight"
;RankIcons[4]="UILibrary_DLC3Images.rank_vanguard"
;RankIcons[5]="UILibrary_DLC3Images.rank_templar"
;RankIcons[6]="UILibrary_DLC3Images.rank_paladin"
;RankIcons[7]="UILibrary_DLC3Images.rank_champion"
